PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1777.inc
DAC6R0           EQU  H'0000'
DAC6R1           EQU  H'0001'
DAC6R2           EQU  H'0002'
DAC6R3           EQU  H'0003'
DAC6R4           EQU  H'0004'
DAC6R5           EQU  H'0005'
DAC6R6           EQU  H'0006'
DAC6R7           EQU  H'0007'


;----- DAC6REFL Bits -----------------------------------------------------
REF0             EQU  H'0000'
REF1             EQU  H'0001'
REF2             EQU  H'0002'
REF3             EQU  H'0003'
REF4             EQU  H'0004'
REF5             EQU  H'0005'
REF6             EQU  H'0006'
REF7             EQU  H'0007'

DAC6REF0         EQU  H'0000'
DAC6REF1         EQU  H'0001'
DAC6REF2         EQU  H'0002'
DAC6REF3         EQU  H'0003'
DAC6REF4         EQU  H'0004'
DAC6REF5         EQU  H'0005'
DAC6REF6         EQU  H'0006'
DAC6REF7         EQU  H'0007'

R0               EQU  H'0000'
R1               EQU  H'0001'
R2               EQU  H'0002'
R3               EQU  H'0003'
R4               EQU  H'0004'
R5               EQU  H'0005'
R6               EQU  H'0006'
R7               EQU  H'0007'

DAC6R0           EQU  H'0000'
DAC6R1           EQU  H'0001'
DAC6R2           EQU  H'0002'
DAC6R3           EQU  H'0003'
DAC6R4           EQU  H'0004'
DAC6R5           EQU  H'0005'
DAC6R6           EQU  H'0006'
DAC6R7           EQU  H'0007'


;----- DAC6CON2 Bits -----------------------------------------------------
REF8             EQU  H'0000'
REF9             EQU  H'0001'
REF10            EQU  H'0002'
REF11            EQU  H'0003'
REF12            EQU  H'0004'
REF13            EQU  H'0005'
REF14            EQU  H'0006'
REF15            EQU  H'0007'

DAC6REF8         EQU  H'0000'
DAC6REF9         EQU  H'0001'
DAC6REF10        EQU  H'0002'
DAC6REF11        EQU  H'0003'
DAC6REF12        EQU  H'0004'
DAC6REF13        EQU  H'0005'
DAC6REF14        EQU  H'0006'
DAC6REF15        EQU  H'0007'

R8               EQU  H'0000'
R9               EQU  H'0001'
R10              EQU  H'0002'
R11              EQU  H'0003'
R12              EQU  H'0004'
R13              EQU  H'0005'
R14              EQU  H'0006'
R15              EQU  H'0007'

DAC6R8           EQU  H'0000'
DAC6R9           EQU  H'0001'
DAC6R10          EQU  H'0002'
DAC6R11          EQU  H'0003'
DAC6R12          EQU  H'0004'
DAC6R13          EQU  H'0005'
DAC6R14          EQU  H'0006'
DAC6R15          EQU  H'0007'


;----- DAC6REFH Bits -----------------------------------------------------
REF8             EQU  H'0000'
REF9             EQU  H'0001'
REF10            EQU  H'0002'
REF11            EQU  H'0003'
REF12            EQU  H'0004'
REF13            EQU  H'0005'
REF14            EQU  H'0006'
REF15            EQU  H'0007'

DAC6REF8         EQU  H'0000'
DAC6REF9         EQU  H'0001'
DAC6REF10        EQU  H'0002'
DAC6REF11        EQU  H'0003'
DAC6REF12        EQU  H'0004'
DAC6REF13        EQU  H'0005'
DAC6REF14        EQU  H'0006'
DAC6REF15        EQU  H'0007'

R8               EQU  H'0000'
R9               EQU  H'0001'
R10              EQU  H'0002'
R11              EQU  H'0003'
R12              EQU  H'0004'
R13              EQU  H'0005'
R14              EQU  H'0006'
R15              EQU  H'0007'

DAC6R8           EQU  H'0000'
DAC6R9           EQU  H'0001'
DAC6R10          EQU  H'0002'
DAC6R11          EQU  H'0003'
DAC6R12          EQU  H'0004'
DAC6R13          EQU  H'0005'
DAC6R14          EQU  H'0006'
DAC6R15          EQU  H'0007'


;----- DAC7CON0 Bits -----------------------------------------------------
OE2              EQU  H'0004'
OE1              EQU  H'0005'
EN               EQU  H'0007'

NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
PSS0             EQU  H'0002'
PSS1             EQU  H'0003'

DACOE2           EQU  H'0004'
DACOE1           EQU  H'0005'
DACEN            EQU  H'0007'

DACNSS0          EQU  H'0000'
DACNSS1          EQU  H'0001'
DACPSS0          EQU  H'0002'
DACPSS1          EQU  H'0003'

DAC7OE2          EQU  H'0004'
DAC7OE1          EQU  H'0005'
DAC7EN           EQU  H'0007'

DAC7NSS0         EQU  H'0000'
DAC7NSS1         EQU  H'0001'
DAC7PSS0         EQU  H'0002'
DAC7PSS1         EQU  H'0003'


;----- DAC7CON1 Bits -----------------------------------------------------
DACR0            EQU  H'0000'
DACR1            EQU  H'0001'
DACR2            EQU  H'0002'
DACR3            EQU  H'0003'
DACR4            EQU  H'0004'

R0               EQU  H'0000'
R1               EQU  H'0001'
R2               EQU  H'0002'
R3               EQU  H'0003'
R4               EQU  H'0004'


DAC7R0           EQU  H'0000'
DAC7R1           EQU  H'0001'
DAC7R2           EQU  H'0002'
DAC7R3           EQU  H'0003'
DAC7R4           EQU  H'0004'

REF0             EQU  H'0000'
REF1             EQU  H'0001'
REF2             EQU  H'0002'
REF3             EQU  H'0003'
REF4             EQU  H'0004'

DAC7REF0         EQU  H'0000'
DAC7REF1         EQU  H'0001'
DAC7REF2         EQU  H'0002'
DAC7REF3         EQU  H'0003'
DAC7REF4         EQU  H'0004'


;----- DAC7REF Bits -----------------------------------------------------
DACR0            EQU  H'0000'
DACR1            EQU  H'0001'
DACR2            EQU  H'0002'
DACR3            EQU  H'0003'
DACR4            EQU  H'0004'

R0               EQU  H'0000'
R1               EQU  H'0001'
R2               EQU  H'0002'
R3               EQU  H'0003'
R4               EQU  H'0004'


DAC7R0           EQU  H'0000'
DAC7R1           EQU  H'0001'
DAC7R2           EQU  H'0002'
DAC7R3           EQU  H'0003'
DAC7R4           EQU  H'0004'

REF0             EQU  H'0000'
REF1             EQU  H'0001'
REF2             EQU  H'0002'
REF3             EQU  H'0003'
REF4             EQU  H'0004'

DAC7REF0         EQU  H'0000'
DAC7REF1         EQU  H'0001'
DAC7REF2         EQU  H'0002'
DAC7REF3         EQU  H'0003'
DAC7REF4         EQU  H'0004'


;----- DAC8CON0 Bits -----------------------------------------------------
OE2              EQU  H'0004'
OE1              EQU  H'0005'
EN               EQU  H'0007'

NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
PSS0             EQU  H'0002'
PSS1             EQU  H'0003'

