PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1777.inc
G3RIS9           EQU  H'0001'
G3RIS11          EQU  H'0003'
G3RIS12          EQU  H'0004'
G3RIS13          EQU  H'0005'
G3RIS14          EQU  H'0006'
G3RIS15          EQU  H'0007'


;----- COG3RSIM0 Bits -----------------------------------------------------
RSIM0            EQU  H'0000'
RSIM1            EQU  H'0001'
RSIM2            EQU  H'0002'
RSIM3            EQU  H'0003'
RSIM4            EQU  H'0004'
RSIM5            EQU  H'0005'
RSIM6            EQU  H'0006'
RSIM7            EQU  H'0007'

G3RSIM0          EQU  H'0000'
G3RSIM1          EQU  H'0001'
G3RSIM2          EQU  H'0002'
G3RSIM3          EQU  H'0003'
G3RSIM4          EQU  H'0004'
G3RSIM5          EQU  H'0005'
G3RSIM6          EQU  H'0006'
G3RSIM7          EQU  H'0007'


;----- COG3RSIM1 Bits -----------------------------------------------------
RSIM9            EQU  H'0001'
RSIM11           EQU  H'0003'
RSIM12           EQU  H'0004'
RSIM13           EQU  H'0005'
RSIM14           EQU  H'0006'
RSIM15           EQU  H'0007'

G3RSIM9          EQU  H'0001'
G3RSIM11         EQU  H'0003'
G3RSIM12         EQU  H'0004'
G3RSIM13         EQU  H'0005'
G3RSIM14         EQU  H'0006'
G3RSIM15         EQU  H'0007'


;----- COG3FIS0 Bits -----------------------------------------------------
FIS0             EQU  H'0000'
FIS1             EQU  H'0001'
FIS2             EQU  H'0002'
FIS3             EQU  H'0003'
FIS4             EQU  H'0004'
FIS5             EQU  H'0005'
FIS6             EQU  H'0006'
FIS7             EQU  H'0007'

G3FIS0           EQU  H'0000'
G3FIS1           EQU  H'0001'
G3FIS2           EQU  H'0002'
G3FIS3           EQU  H'0003'
G3FIS4           EQU  H'0004'
G3FIS5           EQU  H'0005'
G3FIS6           EQU  H'0006'
G3FIS7           EQU  H'0007'


;----- COG3FIS1 Bits -----------------------------------------------------
FIS9             EQU  H'0001'
FIS11            EQU  H'0003'
FIS12            EQU  H'0004'
FIS13            EQU  H'0005'
FIS14            EQU  H'0006'
FIS15            EQU  H'0007'

G3FIS9           EQU  H'0001'
G3FIS11          EQU  H'0003'
G3FIS12          EQU  H'0004'
G3FIS13          EQU  H'0005'
G3FIS14          EQU  H'0006'
G3FIS15          EQU  H'0007'


;----- COG3FSIM0 Bits -----------------------------------------------------
FSIM0            EQU  H'0000'
FSIM1            EQU  H'0001'
FSIM2            EQU  H'0002'
FSIM3            EQU  H'0003'
FSIM4            EQU  H'0004'
FSIM5            EQU  H'0005'
FSIM6            EQU  H'0006'
FSIM7            EQU  H'0007'

G3FSIM0          EQU  H'0000'
G3FSIM1          EQU  H'0001'
G3FSIM2          EQU  H'0002'
G3FSIM3          EQU  H'0003'
G3FSIM4          EQU  H'0004'
G3FSIM5          EQU  H'0005'
G3FSIM6          EQU  H'0006'
G3FSIM7          EQU  H'0007'


;----- COG3FSIM1 Bits -----------------------------------------------------
FSIM9            EQU  H'0001'
FSIM11           EQU  H'0003'
FSIM12           EQU  H'0004'
FSIM13           EQU  H'0005'
FSIM14           EQU  H'0006'
FSIM15           EQU  H'0007'

G3FSIM9          EQU  H'0001'
G3FSIM11         EQU  H'0003'
G3FSIM12         EQU  H'0004'
G3FSIM13         EQU  H'0005'
G3FSIM14         EQU  H'0006'
G3FSIM15         EQU  H'0007'


;----- COG3ASD0 Bits -----------------------------------------------------
ASREN            EQU  H'0006'
ASE              EQU  H'0007'

ASDAC0           EQU  H'0002'
ASDAC1           EQU  H'0003'
ASDBD0           EQU  H'0004'
ASDBD1           EQU  H'0005'
ARSEN            EQU  H'0006'

G3ARSEN          EQU  H'0006'
G3ASE            EQU  H'0007'

G3ASDAC0         EQU  H'0002'
G3ASDAC1         EQU  H'0003'
G3ASDBD0         EQU  H'0004'
G3ASDBD1         EQU  H'0005'
G3ASREN          EQU  H'0006'


;----- COG3ASD1 Bits -----------------------------------------------------
AS0E             EQU  H'0000'
AS1E             EQU  H'0001'
AS2E             EQU  H'0002'
AS3E             EQU  H'0003'
AS4E             EQU  H'0004'
AS5E             EQU  H'0005'
AS6E             EQU  H'0006'
AS7E             EQU  H'0007'

G3AS0E           EQU  H'0000'
G3AS1E           EQU  H'0001'
G3AS2E           EQU  H'0002'
G3AS3E           EQU  H'0003'
G3AS4E           EQU  H'0004'
G3AS5E           EQU  H'0005'
G3AS6E           EQU  H'0006'
G3AS7E           EQU  H'0007'


;----- COG3STR Bits -----------------------------------------------------
STRA             EQU  H'0000'
STRB             EQU  H'0001'
STRC             EQU  H'0002'
STRD             EQU  H'0003'
SDATA            EQU  H'0004'
SDATB            EQU  H'0005'
SDATC            EQU  H'0006'
SDATD            EQU  H'0007'

G3STRA           EQU  H'0000'
G3STRB           EQU  H'0001'
G3STRC           EQU  H'0002'
G3STRD           EQU  H'0003'
G3SDATA          EQU  H'0004'
G3SDATB          EQU  H'0005'
G3SDATC          EQU  H'0006'
G3SDATD          EQU  H'0007'


;----- COG4PHR Bits -----------------------------------------------------
PHR0             EQU  H'0000'
PHR1             EQU  H'0001'
PHR2             EQU  H'0002'
PHR3             EQU  H'0003'
PHR4             EQU  H'0004'
PHR5             EQU  H'0005'

G4PHR0           EQU  H'0000'
G4PHR1           EQU  H'0001'
G4PHR2           EQU  H'0002'
G4PHR3           EQU  H'0003'
G4PHR4           EQU  H'0004'
G4PHR5           EQU  H'0005'


;----- COG4PHF Bits -----------------------------------------------------
PHF0             EQU  H'0000'
PHF1             EQU  H'0001'
PHF2             EQU  H'0002'
PHF3             EQU  H'0003'
PHF4             EQU  H'0004'
PHF5             EQU  H'0005'

G4PHF0           EQU  H'0000'
G4PHF1           EQU  H'0001'
G4PHF2           EQU  H'0002'
G4PHF3           EQU  H'0003'
G4PHF4           EQU  H'0004'
G4PHF5           EQU  H'0005'


;----- COG4BLKR Bits -----------------------------------------------------
BLKR0            EQU  H'0000'
BLKR1            EQU  H'0001'
BLKR2            EQU  H'0002'
BLKR3            EQU  H'0003'
BLKR4            EQU  H'0004'
BLKR5            EQU  H'0005'

G4BLKR0          EQU  H'0000'
G4BLKR1          EQU  H'0001'
G4BLKR2          EQU  H'0002'
G4BLKR3          EQU  H'0003'
G4BLKR4          EQU  H'0004'
G4BLKR5          EQU  H'0005'


;----- COG4BLKF Bits -----------------------------------------------------
BLKF0            EQU  H'0000'
BLKF1            EQU  H'0001'
BLKF2            EQU  H'0002'
BLKF3            EQU  H'0003'
BLKF4            EQU  H'0004'
BLKF5            EQU  H'0005'

