PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1777.inc
G4STRA           EQU  H'0000'
G4STRB           EQU  H'0001'
G4STRC           EQU  H'0002'
G4STRD           EQU  H'0003'
G4SDATA          EQU  H'0004'
G4SDATB          EQU  H'0005'
G4SDATC          EQU  H'0006'
G4SDATD          EQU  H'0007'


;----- CM4CON0 Bits -----------------------------------------------------
SYNC_CM4CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM4CON0      EQU  H'0004'
OUT_CM4CON0      EQU  H'0006'
ON_CM4CON0       EQU  H'0007'

C4SYNC           EQU  H'0000'
C4HYS            EQU  H'0001'
C4SP             EQU  H'0002'
C4ZLF            EQU  H'0003'
C4POL            EQU  H'0004'
C4OUT            EQU  H'0006'
C4ON             EQU  H'0007'


;----- CM4CON1 Bits -----------------------------------------------------
INTN_CM4CON1     EQU  H'0000'
INTP_CM4CON1     EQU  H'0001'

C4INTN           EQU  H'0000'
C4INTP           EQU  H'0001'


;----- CM4NSEL Bits -----------------------------------------------------
C4NCH0           EQU  H'0000'
C4NCH1           EQU  H'0001'
C4NCH2           EQU  H'0002'
C4NCH3           EQU  H'0003'


;----- CM4PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C4PCH0           EQU  H'0000'
C4PCH1           EQU  H'0001'
C4PCH2           EQU  H'0002'
C4PCH3           EQU  H'0003'


;----- CM5CON0 Bits -----------------------------------------------------
SYNC_CM5CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM5CON0      EQU  H'0004'
OUT_CM5CON0      EQU  H'0006'
ON_CM5CON0       EQU  H'0007'

C5SYNC           EQU  H'0000'
C5HYS            EQU  H'0001'
C5SP             EQU  H'0002'
C5ZLF            EQU  H'0003'
C5POL            EQU  H'0004'
C5OUT            EQU  H'0006'
C5ON             EQU  H'0007'


;----- CM5CON1 Bits -----------------------------------------------------
INTN_CM5CON1     EQU  H'0000'
INTP_CM5CON1     EQU  H'0001'

C5INTN           EQU  H'0000'
C5INTP           EQU  H'0001'


;----- CM5NSEL Bits -----------------------------------------------------
C5NCH0           EQU  H'0000'
C5NCH1           EQU  H'0001'
C5NCH2           EQU  H'0002'
C5NCH3           EQU  H'0003'


;----- CM5PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C5PCH0           EQU  H'0000'
C5PCH1           EQU  H'0001'
C5PCH2           EQU  H'0002'
C5PCH3           EQU  H'0003'


;----- CM6CON0 Bits -----------------------------------------------------
SYNC_CM6CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM6CON0      EQU  H'0004'
OUT_CM6CON0      EQU  H'0006'
ON_CM6CON0       EQU  H'0007'

C6SYNC           EQU  H'0000'
C6HYS            EQU  H'0001'
C6SP             EQU  H'0002'
C6ZLF            EQU  H'0003'
C6POL            EQU  H'0004'
C6OUT            EQU  H'0006'
C6ON             EQU  H'0007'


;----- CM6CON1 Bits -----------------------------------------------------
INTN_CM6CON1     EQU  H'0000'
INTP_CM6CON1     EQU  H'0001'

C6INTN           EQU  H'0000'
C6INTP           EQU  H'0001'


;----- CM6NSEL Bits -----------------------------------------------------
C6NCH0           EQU  H'0000'
C6NCH1           EQU  H'0001'
C6NCH2           EQU  H'0002'
C6NCH3           EQU  H'0003'


;----- CM6PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C6PCH0           EQU  H'0000'
C6PCH1           EQU  H'0001'
C6PCH2           EQU  H'0002'
C6PCH3           EQU  H'0003'


;----- CM7CON0 Bits -----------------------------------------------------
SYNC_CM7CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM7CON0      EQU  H'0004'
OUT_CM7CON0      EQU  H'0006'
ON_CM7CON0       EQU  H'0007'

C7SYNC           EQU  H'0000'
C7HYS            EQU  H'0001'
C7SP             EQU  H'0002'
C7ZLF            EQU  H'0003'
C7POL            EQU  H'0004'
C7OUT            EQU  H'0006'
C7ON             EQU  H'0007'


;----- CM7CON1 Bits -----------------------------------------------------
INTN_CM7CON1     EQU  H'0000'
INTP_CM7CON1     EQU  H'0001'

C7INTN           EQU  H'0000'
C7INTP           EQU  H'0001'


;----- CM7NSEL Bits -----------------------------------------------------
C7NCH0           EQU  H'0000'
C7NCH1           EQU  H'0001'
C7NCH2           EQU  H'0002'
C7NCH3           EQU  H'0003'


;----- CM7PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C7PCH0           EQU  H'0000'
C7PCH1           EQU  H'0001'
C7PCH2           EQU  H'0002'
C7PCH3           EQU  H'0003'


;----- CM8CON0 Bits -----------------------------------------------------
SYNC_CM8CON0     EQU  H'0000'
HYS              EQU  H'0001'
Reserved         EQU  H'0002'
ZLF              EQU  H'0003'
POL_CM8CON0      EQU  H'0004'
OUT_CM8CON0      EQU  H'0006'
ON_CM8CON0       EQU  H'0007'

C8SYNC           EQU  H'0000'
C8HYS            EQU  H'0001'
C8SP             EQU  H'0002'
C8ZLF            EQU  H'0003'
C8POL            EQU  H'0004'
C8OUT            EQU  H'0006'
C8ON             EQU  H'0007'


;----- CM8CON1 Bits -----------------------------------------------------
INTN_CM8CON1     EQU  H'0000'
INTP_CM8CON1     EQU  H'0001'

C8INTN           EQU  H'0000'
C8INTP           EQU  H'0001'


;----- CM8NSEL Bits -----------------------------------------------------
C8NCH0           EQU  H'0000'
C8NCH1           EQU  H'0001'
C8NCH2           EQU  H'0002'
C8NCH3           EQU  H'0003'


;----- CM8PSEL Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
PCH3             EQU  H'0003'


C8PCH0           EQU  H'0000'
C8PCH1           EQU  H'0001'
C8PCH2           EQU  H'0002'
C8PCH3           EQU  H'0003'


;----- MD4CON0 Bits -----------------------------------------------------
BIT              EQU  H'0000'
OPOL             EQU  H'0004'
OUT_MD4CON0      EQU  H'0005'
EN               EQU  H'0007'

MD4BIT           EQU  H'0000'
MD4OPOL          EQU  H'0004'
MD4OUT           EQU  H'0005'
MD4EN            EQU  H'0007'


;----- MD4CON1 Bits -----------------------------------------------------
CLSYNC           EQU  H'0000'
CLPOL            EQU  H'0001'
CHSYNC           EQU  H'0004'
CHPOL            EQU  H'0005'

