PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16f1777.inc
PWM5PRIF         EQU  H'0000'
PWM5DCIF         EQU  H'0001'
PWM5PHIF         EQU  H'0002'
PWM5OFIF         EQU  H'0003'


;----- PWM5INTFLG Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM5PRIF         EQU  H'0000'
PWM5DCIF         EQU  H'0001'
PWM5PHIF         EQU  H'0002'
PWM5OFIF         EQU  H'0003'


;----- PWM5CLKCON Bits -----------------------------------------------------
PWM5CS0          EQU  H'0000'
PWM5CS1          EQU  H'0001'
PWM5CS2          EQU  H'0002'
PWM5PS0          EQU  H'0004'
PWM5PS1          EQU  H'0005'
PWM5PS2          EQU  H'0006'


CS0_PWM5CLKCON   EQU  H'0000'
CS1_PWM5CLKCON   EQU  H'0001'
CS2              EQU  H'0002'
PS0_PWM5CLKCON   EQU  H'0004'
PS1_PWM5CLKCON   EQU  H'0005'
PS2_PWM5CLKCON   EQU  H'0006'


;----- PWM5LDCON Bits -----------------------------------------------------
LDT              EQU  H'0006'
LDA              EQU  H'0007'

PWM5LDS0         EQU  H'0000'
PWM5LDS1         EQU  H'0001'

PWM5LDM          EQU  H'0006'
PWM5LD           EQU  H'0007'

LDS0             EQU  H'0000'
LDS1             EQU  H'0001'


;----- PWM5OFCON Bits -----------------------------------------------------
OFO              EQU  H'0004'

PWM5OFS0         EQU  H'0000'
PWM5OFS1         EQU  H'0001'
PWM5OFM0         EQU  H'0005'
PWM5OFM1         EQU  H'0006'

PWM5OFMC         EQU  H'0004'

OFS0             EQU  H'0000'
OFS1             EQU  H'0001'
OFM0             EQU  H'0005'
OFM1             EQU  H'0006'


;----- PWM6PHL Bits -----------------------------------------------------
PWM6PHL0         EQU  H'0000'
PWM6PHL1         EQU  H'0001'
PWM6PHL2         EQU  H'0002'
PWM6PHL3         EQU  H'0003'
PWM6PHL4         EQU  H'0004'
PWM6PHL5         EQU  H'0005'
PWM6PHL6         EQU  H'0006'
PWM6PHL7         EQU  H'0007'



;----- PWM6PHH Bits -----------------------------------------------------
PWM6PHH0         EQU  H'0000'
PWM6PHH1         EQU  H'0001'
PWM6PHH2         EQU  H'0002'
PWM6PHH3         EQU  H'0003'
PWM6PHH4         EQU  H'0004'
PWM6PHH5         EQU  H'0005'
PWM6PHH6         EQU  H'0006'
PWM6PHH7         EQU  H'0007'



;----- PWM6DCL Bits -----------------------------------------------------
PWM6DCL0         EQU  H'0000'
PWM6DCL1         EQU  H'0001'
PWM6DCL2         EQU  H'0002'
PWM6DCL3         EQU  H'0003'
PWM6DCL4         EQU  H'0004'
PWM6DCL5         EQU  H'0005'
PWM6DCL6         EQU  H'0006'
PWM6DCL7         EQU  H'0007'



;----- PWM6DCH Bits -----------------------------------------------------
PWM6DCH0         EQU  H'0000'
PWM6DCH1         EQU  H'0001'
PWM6DCH2         EQU  H'0002'
PWM6DCH3         EQU  H'0003'
PWM6DCH4         EQU  H'0004'
PWM6DCH5         EQU  H'0005'
PWM6DCH6         EQU  H'0006'
PWM6DCH7         EQU  H'0007'



;----- PWM6PRL Bits -----------------------------------------------------
PWM6PRL0         EQU  H'0000'
PWM6PRL1         EQU  H'0001'
PWM6PRL2         EQU  H'0002'
PWM6PRL3         EQU  H'0003'
PWM6PRL4         EQU  H'0004'
PWM6PRL5         EQU  H'0005'
PWM6PRL6         EQU  H'0006'
PWM6PRL7         EQU  H'0007'



;----- PWM6PRH Bits -----------------------------------------------------
PWM6PRH0         EQU  H'0000'
PWM6PRH1         EQU  H'0001'
PWM6PRH2         EQU  H'0002'
PWM6PRH3         EQU  H'0003'
PWM6PRH4         EQU  H'0004'
PWM6PRH5         EQU  H'0005'
PWM6PRH6         EQU  H'0006'
PWM6PRH7         EQU  H'0007'



;----- PWM6OFL Bits -----------------------------------------------------
PWM6OFL0         EQU  H'0000'
PWM6OFL1         EQU  H'0001'
PWM6OFL2         EQU  H'0002'
PWM6OFL3         EQU  H'0003'
PWM6OFL4         EQU  H'0004'
PWM6OFL5         EQU  H'0005'
PWM6OFL6         EQU  H'0006'
PWM6OFL7         EQU  H'0007'



;----- PWM6OFH Bits -----------------------------------------------------
PWM6OFH0         EQU  H'0000'
PWM6OFH1         EQU  H'0001'
PWM6OFH2         EQU  H'0002'
PWM6OFH3         EQU  H'0003'
PWM6OFH4         EQU  H'0004'
PWM6OFH5         EQU  H'0005'
PWM6OFH6         EQU  H'0006'
PWM6OFH7         EQU  H'0007'



;----- PWM6TMRL Bits -----------------------------------------------------
PWM6TMRL0        EQU  H'0000'
PWM6TMRL1        EQU  H'0001'
PWM6TMRL2        EQU  H'0002'
PWM6TMRL3        EQU  H'0003'
PWM6TMRL4        EQU  H'0004'
PWM6TMRL5        EQU  H'0005'
PWM6TMRL6        EQU  H'0006'
PWM6TMRL7        EQU  H'0007'



;----- PWM6TMRH Bits -----------------------------------------------------
PWM6TMRH0        EQU  H'0000'
PWM6TMRH1        EQU  H'0001'
PWM6TMRH2        EQU  H'0002'
PWM6TMRH3        EQU  H'0003'
PWM6TMRH4        EQU  H'0004'
PWM6TMRH5        EQU  H'0005'
PWM6TMRH6        EQU  H'0006'
PWM6TMRH7        EQU  H'0007'



;----- PWM6CON Bits -----------------------------------------------------
POL_PWM6CON      EQU  H'0004'
OUT_PWM6CON      EQU  H'0005'
EN               EQU  H'0007'

PWM6MODE0        EQU  H'0002'
PWM6MODE1        EQU  H'0003'

PWM6POL          EQU  H'0004'
PWM6OUT          EQU  H'0005'
PWM6EN           EQU  H'0007'

MODE0_PWM6CON    EQU  H'0002'
MODE1_PWM6CON    EQU  H'0003'


;----- PWM6INTCON Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM6PRIE         EQU  H'0000'
PWM6DCIE         EQU  H'0001'
PWM6PHIE         EQU  H'0002'
PWM6OFIE         EQU  H'0003'


;----- PWM6INTE Bits -----------------------------------------------------
PRIE             EQU  H'0000'
DCIE             EQU  H'0001'
PHIE             EQU  H'0002'
OFIE             EQU  H'0003'

PWM6PRIE         EQU  H'0000'
PWM6DCIE         EQU  H'0001'
PWM6PHIE         EQU  H'0002'
PWM6OFIE         EQU  H'0003'


;----- PWM6INTF Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

PWM6PRIF         EQU  H'0000'
PWM6DCIF         EQU  H'0001'
PWM6PHIF         EQU  H'0002'
PWM6OFIF         EQU  H'0003'


;----- PWM6INTFLG Bits -----------------------------------------------------
PRIF             EQU  H'0000'
DCIF             EQU  H'0001'
PHIF             EQU  H'0002'
OFIF             EQU  H'0003'

